app/controllers/users_controller.rb

UPDATE "users" SET "password_salt" = 'c14xO1_ZbEmRKxiync4A', "crypted_password" = 'a41ba551ed968db31aa7918705f8ff3695369ede94a6a46485e245caf7700cf28ad62e4d9693f580e0fccbf1959c85faa8cf497d813f98042a02d9c0b17351bc', "persistence_token" = '55684f4a3d41569c9922c5fd77f9ccfd8dae21a39be9adca044da821aa4f3a459e4559b40417bc5599439701e26653ae0466e9ff55333cc9ad28a9a86394cf9c', "perishable_token" = 'iKdpBhar0XWKnchLjsFx', "last_request_at" = '2010-03-16 21:34:44', "login_count" = 2, "last_login_at" = '2010-03-16 21:31:40', "current_login_at" = '2010-03-16 21:34:44', "last_login_ip" = '127.0.0.1', "updated_at" = '2010-03-16 21:34:44' WHERE "id" = 1
---
  def update
    enforce_update_permission(@user)
    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def find_user
    if(params[:id])
      @user = User.find(params[:id])